# Виды задач:
## I. Задача регрессии.
## II .Задача классификации.

###  Виды классификации:

##### 1. Бинарная(0/1)
##### 2. Многоклассовая
2.1 С непересекающими классами
2.2 С пересекающимися классами

## III. Типы признаков:
##### 1. Вещественные
##### 2. Бинарные
##### 3. Категориальные/порядковые
##### 4. Set-valued(Множественнозначные)

## Задача 1: Кликнет ли человек на ссылку?
### Признаки:
##### 1. Пол
##### 2. Возраст
##### 3. Заходил ли на такой сайт?
##### 4. Класс(студент, клерк, домосед и т.д)

## Задача 2: Хотим открыть ресторан, будут ходить или нет?
### Признаки:
##### 1. Есть ли рядом другие рестораны?
##### 2. Средний пассажиропоток
##### 3. Есть ли рядом станция метро/какие-то другие заведения?
##### 4. Популярность заведений в городе

# Семинар по pandas:

In [1]:
import numpy as np
import pandas as pd

In [3]:
data = pd.read_csv("https://raw.githubusercontent.com/iad34/seminars/master/materials/data_sem1.csv", sep = ';')

###### Вывод начала таблицы данных:

In [5]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,Braund; Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,Cumings; Mrs. John Bradley (Florence Briggs Th...,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,Heikkinen; Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,Futrelle; Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,Allen; Mr. William Henry,male,35.0,0,0,373450,8.0500,NaN,S

###### Индексирование:

In [6]:
data.index

RangeIndex(start=0, stop=891, step=1)

In [7]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [8]:
data[["Age","Sex", "Cabin"]].head(5)

    Age     Sex Cabin
0  22.0    male   NaN
1  38.0  female   C85
2  26.0  female   NaN
3  35.0  female  C123
4  35.0    male   NaN

In [9]:
data[data.columns[:-1]].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin
0,1,0,3,Braund; Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,NaN
1,2,1,1,Cumings; Mrs. John Bradley (Florence Briggs Th...,female,38.0,1,0,PC 17599,71.2833,C85
2,3,1,3,Heikkinen; Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN
3,4,1,1,Futrelle; Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123
4,5,0,3,Allen; Mr. William Henry,male,35.0,0,0,373450,8.0500,NaN

In [10]:
data.ix[data.index[3:5]]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
3,4,1,1,Futrelle; Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.10,C123,S
4,5,0,3,Allen; Mr. William Henry,male,35.0,0,0,373450,8.05,NaN,S

In [11]:
data.shape

(891, 12)

In [13]:
data.ix[np.arange(0,data.shape[0],2)].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,Braund; Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,Heikkinen; Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,Allen; Mr. William Henry,male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,McCarthy; Mr. Timothy J,male,54.0,0,0,17463,51.8625,E46,S
8,9,1,3,Johnson; Mrs. Oscar W (Elisabeth Vilhelmina Berg),female,27.0,0,2,347742,11.1333,NaN,S

In [14]:
data.ix[data.index[::2]].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,Braund; Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,Heikkinen; Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,Allen; Mr. William Henry,male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,McCarthy; Mr. Timothy J,male,54.0,0,0,17463,51.8625,E46,S
8,9,1,3,Johnson; Mrs. Oscar W (Elisabeth Vilhelmina Berg),female,27.0,0,2,347742,11.1333,NaN,S

In [15]:
data.ix[data.index % 2 == 0].head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,Braund; Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,Heikkinen; Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,Allen; Mr. William Henry,male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,McCarthy; Mr. Timothy J,male,54.0,0,0,17463,51.8625,E46,S
8,9,1,3,Johnson; Mrs. Oscar W (Elisabeth Vilhelmina Berg),female,27.0,0,2,347742,11.1333,NaN,S

###### UCI datasets - склад данных

In [16]:
data.set_index(data["Name"], inplace = True)

In [17]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,,
Braund; Mr. Owen Harris,1,0,3,Braund; Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,NaN,S
Cumings; Mrs. John Bradley (Florence Briggs Thayer),2,1,1,Cumings; Mrs. John Bradley (Florence Briggs Th...,female,38.0,1,0,PC 17599,71.2833,C85,C
Heikkinen; Miss. Laina,3,1,3,Heikkinen; Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
Futrelle; Mrs. Jacques Heath (Lily May Peel),4,1,1,Futrelle; Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123,S
Allen; Mr. William Henry,5,0,3,Allen; Mr. William Henry,male,35.0,0,0,373450,8.0500,NaN,S

In [21]:
type(data["Age"])

pandas.core.series.Series

In [23]:
type(data)

pandas.core.frame.DataFrame

In [25]:
data.describe()

D:\Program Files\Anaconda3\lib\site-packages\numpy\lib\function_base.py:3834: RuntimeWarning: Invalid value encountered in percentile
  RuntimeWarning)

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,NaN,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,NaN,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,NaN,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [26]:
data["Sex"].head()

Name
Braund; Mr. Owen Harris                                  male
Cumings; Mrs. John Bradley (Florence Briggs Thayer)    female
Heikkinen; Miss. Laina                                 female
Futrelle; Mrs. Jacques Heath (Lily May Peel)           female
Allen; Mr. William Henry                                 male
Name: Sex, dtype: object

In [27]:
set(data["Sex"])

{'female', 'male', 'unknown'}

In [28]:
data["Sex"].value_counts()

male       574
female     312
unknown      5
Name: Sex, dtype: int64

In [29]:
data["Age"].value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
30.00    25
21.00    24
25.00    23
36.00    22
29.00    20
27.00    18
35.00    18
26.00    18
32.00    18
31.00    17
16.00    17
23.00    15
20.00    15
34.00    15
33.00    15
39.00    14
17.00    13
40.00    13
42.00    13
45.00    12
38.00    11
50.00    10
2.00     10
4.00     10
48.00     9
         ..
0.75      2
45.50     2
64.00     2
30.50     2
0.83      2
32.50     2
40.50     2
71.00     2
28.50     2
63.00     2
59.00     2
57.00     2
55.00     2
70.00     2
55.50     1
24.50     1
34.50     1
0.92      1
36.50     1
0.42      1
23.50     1
12.00     1
20.50     1
14.50     1
80.00     1
74.00     1
70.50     1
66.00     1
53.00     1
0.67      1
Name: Age, dtype: int64

In [30]:
sex = data["Sex"]
sex.map({"male":1,"female":-1, "unknown": 0})

Name
Braund; Mr. Owen Harris                                      1
Cumings; Mrs. John Bradley (Florence Briggs Thayer)         -1
Heikkinen; Miss. Laina                                      -1
Futrelle; Mrs. Jacques Heath (Lily May Peel)                -1
Allen; Mr. William Henry                                     1
Moran; Mr. James                                             0
McCarthy; Mr. Timothy J                                      1
Palsson; Master. Gosta Leonard                               1
Johnson; Mrs. Oscar W (Elisabeth Vilhelmina Berg)           -1
Nasser; Mrs. Nicholas (Adele Achem)                         -1
Sandstrom; Miss. Marguerite Rut                             -1
Bonnell; Miss. Elizabeth                                    -1
Saundercock; Mr. William Henry                               1
Andersson; Mr. Anders Johan                                  0
Vestrom; Miss. Hulda Amanda Adolfina                        -1
Hewlett; Mrs. (Mary D Kingcome)                             -1
Rice; Master. Eugene                                         1
Williams; Mr. Charles Eugene                                 1
Vander Planke; Mrs. Julius (Emelia Maria Vandemoortele)     -1
Masselmani; Mrs. Fatima                                     -1
Fynney; Mr. Joseph J                                         1
Beesley; Mr. Lawrence                                        1
McGowan; Miss. Anna "Annie"                                 -1
Sloper; Mr. William Thompson                                 1
Palsson; Miss. Torborg Danira                               -1
Asplund; Mrs. Carl Oscar (Selma Augusta Emilia Johansson)   -1
Emir; Mr. Farred Chehab                                      1
Fortune; Mr. Charles Alexander                               1
O'Dwyer; Miss. Ellen "Nellie"                                0
Todoroff; Mr. Lalio                                          1
                                                            ..
Giles; Mr. Frederick Edward                                  1
Swift; Mrs. Frederick Joel (Margaret Welles Barron)         -1
Sage; Miss. Dorothy Edith "Dolly"                           -1
Gill; Mr. John William                                       1
Bystrom; Mrs. (Karolina)                                    -1
Duran y More; Miss. Asuncion                                -1
Roebling; Mr. Washington Augustus II                         1
van Melkebeke; Mr. Philemon                                  1
Johnson; Master. Harold Theodor                              1
Balkic; Mr. Cerin                                            1
Beckwith; Mrs. Richard Leonard (Sallie Monypeny)            -1
Carlsson; Mr. Frans Olof                                     1
Vander Cruyssen; Mr. Victor                                  1
Abelson; Mrs. Samuel (Hannah Wizosky)                       -1
Najib; Miss. Adele Kiamie "Jane"                            -1
Gustafsson; Mr. Alfred Ossian                                1
Petroff; Mr. Nedelio                                         1
Laleff; Mr. Kristo                                           1
Potter; Mrs. Thomas Jr (Lily Alexenia Wilson)               -1
Shelley; Mrs. William (Imanita Parrish Hall)                -1
Markun; Mr. Johann                                           1
Dahlberg; Miss. Gerda Ulrika                                -1
Banfield; Mr. Frederick James                                1
Sutehall; Mr. Henry Jr                                       1
Rice; Mrs. William (Margaret Norton)                        -1
Montvila; Rev. Juozas                                        1
Graham; Miss. Margaret Edith                                -1
Johnston; Miss. Catherine Helen "Carrie"                    -1
Behr; Mr. Karl Howell                                        1
Dooley; Mr. Patrick                                          1
Name: Sex, dtype: int64

In [31]:
data["Age"].apply(lambda x: x+100)

Name
Braund; Mr. Owen Harris                                      122.0
Cumings; Mrs. John Bradley (Florence Briggs Thayer)          138.0
Heikkinen; Miss. Laina                                       126.0
Futrelle; Mrs. Jacques Heath (Lily May Peel)                 135.0
Allen; Mr. William Henry                                     135.0
Moran; Mr. James                                               NaN
McCarthy; Mr. Timothy J                                      154.0
Palsson; Master. Gosta Leonard                               102.0
Johnson; Mrs. Oscar W (Elisabeth Vilhelmina Berg)            127.0
Nasser; Mrs. Nicholas (Adele Achem)                          114.0
Sandstrom; Miss. Marguerite Rut                              104.0
Bonnell; Miss. Elizabeth                                     158.0
Saundercock; Mr. William Henry                               120.0
Andersson; Mr. Anders Johan                                  139.0
Vestrom; Miss. Hulda Amanda Adolfina                         114.0
Hewlett; Mrs. (Mary D Kingcome)                              155.0
Rice; Master. Eugene                                         102.0
Williams; Mr. Charles Eugene                                   NaN
Vander Planke; Mrs. Julius (Emelia Maria Vandemoortele)      131.0
Masselmani; Mrs. Fatima                                        NaN
Fynney; Mr. Joseph J                                         135.0
Beesley; Mr. Lawrence                                        134.0
McGowan; Miss. Anna "Annie"                                  115.0
Sloper; Mr. William Thompson                                 128.0
Palsson; Miss. Torborg Danira                                108.0
Asplund; Mrs. Carl Oscar (Selma Augusta Emilia Johansson)    138.0
Emir; Mr. Farred Chehab                                        NaN
Fortune; Mr. Charles Alexander                               119.0
O'Dwyer; Miss. Ellen "Nellie"                                  NaN
Todoroff; Mr. Lalio                                            NaN
                                                             ...
Giles; Mr. Frederick Edward                                  121.0
Swift; Mrs. Frederick Joel (Margaret Welles Barron)          148.0
Sage; Miss. Dorothy Edith "Dolly"                              NaN
Gill; Mr. John William                                       124.0
Bystrom; Mrs. (Karolina)                                     142.0
Duran y More; Miss. Asuncion                                 127.0
Roebling; Mr. Washington Augustus II                         131.0
van Melkebeke; Mr. Philemon                                    NaN
Johnson; Master. Harold Theodor                              104.0
Balkic; Mr. Cerin                                            126.0
Beckwith; Mrs. Richard Leonard (Sallie Monypeny)             147.0
Carlsson; Mr. Frans Olof                                     133.0
Vander Cruyssen; Mr. Victor                                  147.0
Abelson; Mrs. Samuel (Hannah Wizosky)                        128.0
Najib; Miss. Adele Kiamie "Jane"                             115.0
Gustafsson; Mr. Alfred Ossian                                120.0
Petroff; Mr. Nedelio                                         119.0
Laleff; Mr. Kristo                                             NaN
Potter; Mrs. Thomas Jr (Lily Alexenia Wilson)                156.0
Shelley; Mrs. William (Imanita Parrish Hall)                 125.0
Markun; Mr. Johann                                           133.0
Dahlberg; Miss. Gerda Ulrika                                 122.0
Banfield; Mr. Frederick James                                128.0
Sutehall; Mr. Henry Jr                                       125.0
Rice; Mrs. William (Margaret Norton)                         139.0
Montvila; Rev. Juozas                                        127.0
Graham; Miss. Margaret Edith                                 119.0
Johnston; Miss. Catherine Helen "Carrie"                       NaN
Behr; Mr. Karl Howell                                        126.0
Dooley; Mr. Patrick                                          132.0
Name: Age, dtype: float64

In [32]:
data.groupby("Sex")['Age']

In [33]:
data.groupby("Sex")['Age'].mean()

Sex
female     27.953846
male       30.774590
unknown    19.276667
Name: Age, dtype: float64

In [34]:
data.groupby("Sex")['Age'].min()

Sex
female     0.75
male       0.42
unknown    0.83
Name: Age, dtype: float64

In [35]:
data.groupby("Sex")['Age'].apply(lambda x : x.mean()**2)

Sex
female     781.417515
male       947.075377
unknown    371.589878
Name: Age, dtype: float64

In [41]:
data["Last Name"]= data["Name"].apply(lambda s: s.split(";")[0])
data.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Last Name
Name,,,,,,,,,,,,,
Braund; Mr. Owen Harris,1,0,3,Braund; Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.25,NaN,S,Braund

In [43]:
(data.groupby("Last Name")["Age"].count() > 3).sum()

16